* Test write_input() and read_input()
  :PROPERTIES:
  :ID:       c0604f0c-09e6-4d2e-a432-45e89479e909
  :END:
#+BEGIN_SRC python
from structopt import *

pot_file = os.path.abspath('Au_u3.eam')
stem_ref = os.path.abspath('STEM_ref.xyz')
psf_file = os.path.abspath('PSF.txt')

with Structopt('tests/write_read_input',
               # Submission paramters
               walltime=24, queue='morgan2', parallel=True,              
               
               # GA parameters
               modules = ['LAMMPS', 'STEM'],
               weights = [0.003, 10.0],
               structure='Cluster', natoms=309,
               atomlist=[['Au', 1, 196.9665, -3.6]],
               generate_flag='sphere', size=23,
               optimizer_type='GA', nindiv=12,
               mutation_options=['lattice_alteration',
                                 'lattice_alteration_group',
                                 'rotation',
                                 'zp_rotation'],
               mutpb=0.2,
               predator='fitpred',
               natural_selection_scheme='fuss',
               convergence_scheme='gen_rep_min',
               maxgen=4000, reqrep=1000,
               tolerance=0.0001, demin=0.001,
               energy_cutoff_factor=4.0,
               seed=6,
               
               # LAMMPS parameters
               pair_style='eam', pot_file=pot_file,
               minimize='1e-8 1e-8 5000 10000',
               min_style=r'cg\nmin_modify line quadratic',
               thermo_steps=1000, keep_files=False,
               
               # Output parameters
               allenergyfile=True, postprocessing=True,
               stem_keep_files=False,
               
               # STEM parameters
               electron_energy=200,
               spherical_aberration=1.4, defocus=0,
               aperture_semiangle=24.5,
               source_size=0.882,
               slice_size=25.0,
               chromatic_aberration_coefficient=1.4,
               delta_E=0.73,
               aber=[[0,0],[0,0],[22.56,-20.1],
                     [22.08,-7.5],[0.1198,0],[0.9018,-170.1],
                     [0.04964,20.9],[28.43,-120.6],[11.84,153.8],
                     [8.456,76.1],[0.622,0],[2.811,-125.5]],
               scale_factor=0.00570113,
               grid_sim2exp=1,
               pixelshift=False,                        
               stem_ref=stem_ref,
               psf=psf_file) as calc:
    calc.write_input()
    print calc.structopt_params == calc.old_structopt_params
    print calc.stem_params == calc.old_stem_params
    print calc.lammps_params == calc.old_lammps_params
    # for key in calc.ga_params:
        # equal = calc.old_ga_params[key] == calc.ga_params[key]
        # print calc.ga_params[key], calc.old_ga_params[key], equal
    


#+END_SRC

#+RESULTS:
: True
: True
: True

** Test new io/read_parameter_input.py
#+BEGIN_SRC python
from StructOpt import io

print io.read_parameter_input('tests/maldonis-test/structopt_inp.json', True)

#+END_SRC

#+RESULTS:
: {'fixed_region': False, 'mutant_add': False, 'bh_temp': 0.08617385692256675, 'bh_steps': 100, 'bulkfp': None, 'generate_flag': 'box', 'migration_intervals': 5, u'natoms': 309, 'algorithm_type': 'lambda+mu', u'predator': u'mutation_dups', 'loggername': 'Output-rank0-2016_0406_084958.log', 'supercell': (1, 1, 1), 'quench_max_temp': 1000, 'allenergyfile': False, 'restart_optimizer': False, 'restart': False, u'natural_selection_scheme': u'fuss', 'quench_step_size': 0.01, u'large_box_size': 500, 'debug': ['None'], 'adaptmultiplier': 3.0, 'solidbulk': None, 'trackvacs': False, u'tournsize': 3, 'fingerprinting': False, 'trackswaps': False, 'constrain_position': False, u'filename': u'Output', u'best_inds_list': True, 'solidfile': None, u'tolerance': 0.01, 'solidcell': None, u'maxgen': 4000, 'quench_n_steps_1': 10000, 'quench_n_steps_2': 20000, 'relaxation': 'LAMMPS', u'selection_scheme': u'tournament2', 'genealogytree': False, 'energy_cutoff_factor': 10.0, 'cell_shape_options': ['cubic', 'hexagonal', 'triclinic', 'monoclinic', 'orthorhombic', 'tetragonal'], u'atomlist': [(u'Au', 309, 196.9665, 0.0)], u'postprocessing': True, 'metropolis_temp': 30.0, u'demin': 0.01, 'optimizer_type': 'GA', u'nindiv': 20, u'size': 23.0, u'mutation_options': [u'lattice_alteration', u'lattice_alteration_group', u'rotation_geo', u'rotation'], 'quench_min_temp': 2, 'mark': None, 'finddefects': True, u'fusslimit': 5, u'reqrep': 1000, 'surftopthick': 0, 'output_format': 'fitness', 'swaplist': False, 'rattle_atoms': False, 'adaptbegin': 0.75, 'lattice_concentration': False, u'genealogy': True, 'random_vac_start': False, u'cx_scheme': u'rotct_rand', 'constrain_swaps': False, 'seed': 9, 'fpbin': 0.25, u'mutpb': 0.15, 'number_of_bests': 100, 'migration_percent': 0.05, u'cxpb': 0.8, 'vacancy_output': False, 'indiv_defect_write': False, u'convergence_scheme': u'max_gen', 'forcing': 'Concentration', 'fpcutoff': 15.0, 'isolate_mutation': False, 'surfacecell': None, u'r_ab': 2.5, 'evalsolid': False, 'surfacefile': None, 'random_loc_start': False, u'parallel': True, u'structure': u'Cluster', 'restart_ints': 0, u'modules': [u'LAMMPS', u'STEM'], u'weights': [0.003, 10.0], 'alloy': True, 'sf': 1.75}

